# 存放所有的常量

# 窗口的总大小（像素）
WIDTH = 800
SIDEBAR = 200  # 侧边栏宽度

# 网格的行数（一行有多少个格子）
ROWS = 50

# 颜色常量 (RGB)
WHITE = (255, 255, 255)              # 默认格子颜色
BLACK = (0, 0, 0)                    # 障碍颜色
GREY = (128, 128, 128)               # 网格边的颜色
DARK_GREY = (50, 50, 50)             # 按钮文字颜色
ORANGE = (255, 128, 0)               # 起点颜色
GREEN = (0, 255, 0)                  # 准备探索的格子颜色
LIGHT_GREEN = (46, 204, 113)         # Dijkstra按钮等颜色
RED = (255, 0, 0)                    # 已经探索的格子颜色
LIGHT_RED = (231, 76, 60)            # 清空网格按钮等颜色
YELLOW = (241, 196, 15)              # 清除路径按钮颜色
BLUE = (52, 152, 219)                # A*按钮等颜色
SAND_COLOR = (210, 180, 140)         # 沙地颜色
SAND_MODE_COLOR = (149, 165, 166)    # 沙地按钮颜色
TURQUOISE = (64, 224, 208)           # 终点颜色
PURPLE = (128, 0, 128)               # 最短路径颜色
LIGHT_PURPLE = (155, 89, 182)        # BFS按钮颜色
SIDEBAR_COLOR = (240, 240, 240)      # 侧边栏背景颜色
PROGRESSBAR_COLOR = (200, 200, 200)  # 进度条颜色
STEP_TEXT_COLOR = (80, 80, 80)       # 步骤文本颜色
SHADOW_COLOR = (180, 180, 180)       # 上 / 下一步按钮颜色
PAUSE_COLOR = (100, 100, 100)        # 播放 / 暂停按钮颜色

# 状态常量
READY = "状态: 就绪"
SUCCESS = "状态: 找到最短路径"
INVALID = "状态: 无合法路径"
CLEAR = "状态: 路径已清除"

# 其他常量
PLAY_SPEED = 0.04  # 播放速度（秒/步），越小越快
